## Segment 1 - Filtering and selecting data

In [2]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

Filtering and selecting using Pandas is one of the most fundamental things you'll do in data analysis. Make sure you know how to use indexing to select and retrieve records.

# Class exercise 1:
1. Create a Pandas Series of 5 fruit names:
["Apple", "Banana", "Mango", "Grapes", "Orange"]

2. Access the following elements:
The first element.
The last element.
The element at index 2.

3. Slice the Series to get:
The first 3 elements.
All elements except the first one.

4. Check if "Mango" is present in the Series.

# Class exercise 2:
1. Create a DataFrame using the following dictionary:

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
}

2. Access elements and rows:

Get the first row of the DataFrame.

Access the 'Age' column.

Get the age of the person at index 3.

3. Slice the DataFrame:

Get the first 3 rows.

Get the 'Name' and 'City' columns for the last 2 rows.

4. Filter rows:
Get all rows where Age > 25.

In [12]:
series_obj = Series(["Apple", "Banana", "Mango", "Grapes", "Orange"])
series_obj

0     Apple
1    Banana
2     Mango
3    Grapes
4    Orange
dtype: object

In [13]:
series_obj[[0,4,2]]

0     Apple
4    Orange
2     Mango
dtype: object

In [14]:
series_obj.iloc[0:3]

0     Apple
1    Banana
2     Mango
dtype: object

In [15]:
series_obj.iloc[1:]

1    Banana
2     Mango
3    Grapes
4    Orange
dtype: object

In [16]:
is_mango_present = "Mango" in series_obj.values
print(is_mango_present)

True

In [22]:
data = { 'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'], 'Age': [24, 27, 22, 32, 29], 'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'] }
df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston
4      Eve   29      Phoenix

In [23]:
df.iloc[0]

Name       Alice
Age           24
City    New York
Name: 0, dtype: object

In [24]:
df['Age']

0    24
1    27
2    22
3    32
4    29
Name: Age, dtype: int64

In [26]:
df['Age'].iloc[3]

32

In [27]:
df.iloc[0:3]

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago

In [29]:
df[['Name', 'City']].iloc[-2:]

    Name     City
3  David  Houston
4    Eve  Phoenix

In [30]:
df[df['Age'] > 25]

    Name  Age         City
1    Bob   27  Los Angeles
3  David   32      Houston
4    Eve   29      Phoenix